---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstOutsideFaceBoundary
source: html/71add4a4-9808-2d37-aab1-6fda4d09d16e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstOutsideFaceBoundary Property

Instance origin does not lie on host face. Instance will lose association to host.

## Syntax (C#)
```csharp
public static FailureDefinitionId InstOutsideFaceBoundary { get; }
```